In [ ]:
import pandas as pd
import numpy as np
df=pd.read_csv("chocolate.csv")
print("data read successfully")
# print(df.info())
# print(df.describe())
# df.columns
# df.columns=df.columns.str.strip()
# df.columns=df.columns.str.lower()
# df.columns=df.columns.str.replace(" ","_")
# print(df.columns)
# df.isnull().sum()
# df.dropna(inplace=True)

data read successfully

In [ ]:
#Display the first 5 rows of the dataset
print(df.head())

     Sales Person    Country              Product        Date      Amount  \
0  Jehu Rudeforth         UK      Mint Chip Choco  04/01/2022   $5,320.00
1     Van Tuxwell      India        85% Dark Bars  01/08/2022   $7,896.00
2    Gigi Bohling      India  Peanut Butter Cubes  07/07/2022   $4,501.00
3    Jan Morforth  Australia  Peanut Butter Cubes  27/04/2022  $12,726.00
4  Jehu Rudeforth         UK  Peanut Butter Cubes  24/02/2022  $13,685.00

   Boxes Shipped
0            180
1             94
2             91
3            342
4            184

In [20]:
# Show basic information about the dataset
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3282 entries, 0 to 3281
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   3282 non-null   object
 1   Country        3282 non-null   object
 2   Product        3282 non-null   object
 3   Date           3282 non-null   object
 4   Amount         3282 non-null   object
 5   Boxes Shipped  3282 non-null   int64
dtypes: int64(1), object(5)
memory usage: 154.0+ KB
None

In [49]:
import pandas as pd
import numpy as np

data = {
    "Name": ["Asha", "Rahul", "Sita", None, "Kiran"],
    "Age": [23, np.nan, 29, 25, None],
    "Salary": [45000, 52000, None, 48000, 51000],
    "City": ["Bangalore", "Mysuru", "Bangalore", "Mysuru", None]
}

df = pd.DataFrame(data)
print(df)

    Name   Age   Salary       City
0   Asha  23.0  45000.0  Bangalore
1  Rahul   NaN  52000.0     Mysuru
2   Sita  29.0      NaN  Bangalore
3   None  25.0  48000.0     Mysuru
4  Kiran   NaN  51000.0       None

In [ ]:
#Ditect missing values
print(df.isnull())
#missimg values summary
print(df.isnull().sum())

    Name    Age  Salary   City
0  False  False   False  False
1  False   True   False  False
2  False  False    True  False
3   True  False   False  False
4  False   True   False   True
Name      1
Age       2
Salary    1
City      1
dtype: int64

In [24]:
#check if any missing values are present
print(df.isnull())
print(df.isnull().values.any())

    Name    Age  Salary   City
0  False  False   False  False
1  False   True   False  False
2  False  False    True  False
3   True  False   False  False
4  False   True   False   True
True

In [26]:
#Remove rows with missing values
df.dropna()

   Name   Age   Salary       City
0  Asha  23.0  45000.0  Bangalore

In [29]:
#Romove columns with missing values
df.dropna(axis=1)

   Name   Age   Salary       City
0  Asha  23.0  45000.0  Bangalore

In [31]:
#fill with fixed value
df.fillna(0)

   Name   Age   Salary       City
0  Asha  23.0  45000.0  Bangalore

In [32]:
import pandas as pd

data = {
    "Age": ["23", "29", "25", "30"],
    "Salary": ["45000", "52000", "48000", "51000"],
    "Join_Date": ["2023-01-10", "2022-12-05", "2023-02-20", "2022-11-15"]
}

df = pd.DataFrame(data)
print(df.dtypes)

Age          object
Salary       object
Join_Date    object
dtype: object

In [35]:
#Safe Conversion with to_numeric()
df["Salary"] = pd.to_numeric(df["Salary"], errors="coerce")
print(df.dtypes)

Age          object
Salary        int64
Join_Date    object
dtype: object

In [ ]:
#Convert Dates (Critical for Analysis)
df["Join_Date"] = pd.to_datetime(df["Join_Date"])
print()

In [36]:
import pandas as pd

data = {
    "Name": [" asha ", "RAHUL", "SiTa", "kiran "],
    "City": [" bangalore", "Mysuru ", "BANGALORE", "mysore"],
    "Gender": ["male", "Male ", " FEMALE", "female"],
    "Salary": ["₹45,000", "52000 ", " 48000", "₹51,000"]
}

df = pd.DataFrame(data)
print(df)

     Name        City   Gender   Salary
0   asha    bangalore     male  ₹45,000
1   RAHUL     Mysuru     Male    52000
2    SiTa   BANGALORE   FEMALE    48000
3  kiran       mysore   female  ₹51,000

In [37]:
#using strip to remove leading and trailing spaces
df["Name"] = df["Name"].str.strip()
df["City"] = df["City"].str.strip()
df["Gender"] = df["Gender"].str.strip()
df["Salary"] = df["Salary"].str.strip()
print(df)

    Name       City  Gender   Salary
0   asha  bangalore    male  ₹45,000
1  RAHUL     Mysuru    Male    52000
2   SiTa  BANGALORE  FEMALE    48000
3  kiran     mysore  female  ₹51,000

In [39]:
#using title to standardize text data
df["Name"] = df["Name"].str.title()
df["City"] = df["City"].str.title()
print(df)

    Name       City  Gender   Salary
0   Asha  Bangalore    male  ₹45,000
1  Rahul     Mysuru    Male    52000
2   Sita  Bangalore  FEMALE    48000
3  Kiran     Mysore  female  ₹51,000

In [42]:
#convert to lowercase
df["Gender"] = df["Gender"].str.lower()
print(df)

    Name       City  Gender   Salary Gender_Lower
0   Asha  Bangalore    male  ₹45,000         male
1  Rahul     Mysuru    male    52000         male
2   Sita  Bangalore  female    48000       female
3  Kiran     Mysore  female  ₹51,000       female

In [43]:
#replacing city names
df["City"] = df["City"].replace({"Mysore": "Mysuru"})
df["City"] = df["City"].replace({"Bangalore": "Bengaluru"})
print(df)

    Name       City  Gender   Salary Gender_Lower
0   Asha  Bengaluru    male  ₹45,000         male
1  Rahul     Mysuru    male    52000         male
2   Sita  Bengaluru  female    48000       female
3  Kiran     Mysuru  female  ₹51,000       female

In [ ]:
#replacing special characters in Salary column using regex
df["Salary"] = df["Salary"].str.replace("₹", "")
df["Salary"] = df["Salary"].str.replace(",", "")
print(df)

    Name       City  Gender Salary Gender_Lower
0   Asha  Bengaluru    male  45000         male
1  Rahul     Mysuru    male  52000         male
2   Sita  Bengaluru  female  48000       female
3  Kiran     Mysuru  female  51000       female

In [45]:
#replacing special characters in Salary column using regex
df["Salary"] = df["Salary"].str.replace("₹|,", "", regex=True)
print(df)

    Name       City  Gender Salary Gender_Lower
0   Asha  Bengaluru    male  45000         male
1  Rahul     Mysuru    male  52000         male
2   Sita  Bengaluru  female  48000       female
3  Kiran     Mysuru  female  51000       female

In [46]:
#using astype to convert Salary to numeric
df["Salary"] = df["Salary"].astype(float)
print(df)

    Name       City  Gender   Salary Gender_Lower
0   Asha  Bengaluru    male  45000.0         male
1  Rahul     Mysuru    male  52000.0         male
2   Sita  Bengaluru  female  48000.0       female
3  Kiran     Mysuru  female  51000.0       female

In [47]:
# using unique to find unique values in City column
print(df["City"].unique())

['Bengaluru' 'Mysuru']

In [ ]:
# using len to find length of the dataset valuses
print(len(df))
print(len(df["City"]))

4
4